{
  "architectures": [
    "Mamba2ForCausalLM"
  ],
  "bos_token_id": 0,
  "conv_kernel": 4,
  "dt_rank": "auto",
  "eos_token_id": 0,
  "expand": 2,
  "fused_add_norm": true,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "head_dim": 64,
  "num_heads": 32,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "layer_norm_epsilon": 1e-05,
  "model_type": "mamba2",
  "pad_token_id": 0,
  "pad_vocab_size_multiple": 8,
  "rescale_prenorm_residual": false,
  "residual_in_fp32": true,
  "rms_norm": true,
  "ssm_cfg": {},
  "state_size": 128,
  "time_step_floor": 0.0001,
  "time_step_init_scheme": "random",
  "time_step_max": 0.1,
  "time_step_min": 0.001,
  "time_step_rank": 160,
  "time_step_scale": 1.0,
  "torch_dtype": "float32",
  "transformers_version": "4.39.0.dev0",
  "use_bias": false,
  "use_cache": false,
  "use_conv_bias": true,
  "vocab_size": 50280,
  "tie_word_embeddings": true,
  "num_lower_layers": 24,
  "num_upper_layers": 24,
  "num_upper_groups": 1,
  "num_mamba_per_gca": 8,
  "n_groups": 1,
  "block_q": 1,
  "chunk_topk": 8,
  "retrieval_dim": 1024,
  "mamba_chunk_size": 256,
  "chunk_size": 64,
  "encoder_layers": 2,
  "num_attention_heads": 16,
  "num_key_value_heads":16,
  "num_kv_heads": 1,
  "lmk_token_id": 50279,
  "segment_size": 4096
}
